In [2]:
import pandas as pd
file_path = './5674-833/part2/read_csv_sample.csv'
df1 = pd.read_csv(file_path)
print(df1)

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [8]:
df = pd.DataFrame(df1)

In [9]:
df

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [10]:
df2 = pd.read_csv(file_path, header=None)

In [11]:
df2

    0   1   2   3
0  c0  c1  c2  c3
1   0   1   4   7
2   1   2   5   8
3   2   3   6   9

In [12]:
df3 = pd.read_csv(file_path, index_col=None)

In [13]:
df3

   c0  c1  c2  c3
0   0   1   4   7
1   1   2   5   8
2   2   3   6   9

In [18]:
df4 = pd.read_csv(file_path, skiprows=[1])

In [19]:
df4

   c0  c1  c2  c3
0   1   2   5   8
1   2   3   6   9

In [20]:
df1 = pd.read_excel('./5674-833/part2/남북한발전전력량.xlsx')

In [22]:
df2 = pd.read_excel('./5674-833/part2/남북한발전전력량.xlsx', header=None)
print(df1[:5], '\n')
print(df2[:5])

  전력량 (억㎾h) 발전 전력별  1990  1991  1992  1993  1994  1995  1996  1997  ...  2007  \
0        남한     합계  1077  1186  1310  1444  1650  1847  2055  2244  ...  4031
1       NaN     수력    64    51    49    60    41    55    52    54  ...    50
2       NaN     화력   484   573   696   803  1022  1122  1264  1420  ...  2551
3       NaN    원자력   529   563   565   581   587   670   739   771  ...  1429
4       NaN    신재생     -     -     -     -     -     -     -     -  ...     -

   2008  2009  2010  2011  2012  2013  2014  2015  2016
0  4224  4336  4747  4969  5096  5171  5220  5281  5404
1    56    56    65    78    77    84    78    58    66
2  2658  2802  3196  3343  3430  3581  3427  3402  3523
3  1510  1478  1486  1547  1503  1388  1564  1648  1620
4     -     -     -     -    86   118   151   173   195

[5 rows x 29 columns]

          0       1     2     3     4     5     6     7     8     9   ...  \
0  전력량 (억㎾h)  발전 전력별  1990  1991  1992  1993  1994  1995  1996  1997  ...
1         남한      합계  1077  1186  1310  1444  1650  1847  2055  2244  ...
2        NaN      수력    64    51    49    60    41    55    52    54  ...
3        NaN      화력   484   573   696   803  1022  1122  1264  1420  ...
4        NaN     원자력   529   563   565   581   587   670   739   771  ...

     19    20    21    22    23    24    25    26    27    28
0  2007  2008  2009  2010  2011  2012  2013  2014  2015  2016
1  4031  4224  4336  4747  4969  5096  5171  5220  5281  5404
2    50    56    56    65    78    77    84    78    58    66
3  2551  2658  2802  3196  3343  3430  3581  3427  3402  3523
4  1429  1510  1478  1486  1547  1503  1388  1564  1648  1620

[5 rows x 29 columns]

In [23]:
df1 = pd.read_json('./5674-833/part2/read_json_sample.json')

In [24]:
df1

           name  year        developer opensource
pandas           2008    Wes Mckinneye       True
NumPy            2006  Travis Oliphant       True
matplotlib       2003   John D. Hunter       True

In [25]:
df1.index

Index(['pandas', 'NumPy', 'matplotlib'], dtype='object')

In [31]:
df1.columns

Index(['name', 'year', 'developer', 'opensource'], dtype='object')

In [33]:
url = './5674-833/part2/sample.html'

In [34]:
tables = pd.read_html(url)

In [36]:
print(len(tables))

2

In [37]:
tables

[   Unnamed: 0  c0  c1  c2  c3
 0           0   0   1   4   7
 1           1   1   2   5   8
 2           2   2   3   6   9,
          name  year        developer  opensource
 0       NumPy  2006  Travis Oliphant        True
 1  matplotlib  2003   John D. Hunter        True
 2      pandas  2008    Wes Mckinneye        True]

In [39]:
for i in range(len(tables)):
    print('tables[%s]' % i)
    print(tables[i])
    print('\n')

tables[0]
   Unnamed: 0  c0  c1  c2  c3
0           0   0   1   4   7
1           1   1   2   5   8
2           2   2   3   6   9


tables[1]
         name  year        developer  opensource
0       NumPy  2006  Travis Oliphant        True
1  matplotlib  2003   John D. Hunter        True
2      pandas  2008    Wes Mckinneye        True

In [44]:
df = tables[1]
df.set_index(['name'], inplace=True)

KeyError: "None of ['name'] are in the columns"

In [45]:
df

            year        developer  opensource
name
NumPy       2006  Travis Oliphant        True
matplotlib  2003   John D. Hunter        True
pandas      2008    Wes Mckinneye        True

In [47]:
from bs4 import BeautifulSoup
import requests
import re
url = 'https://en.wikipedia.org/wiki/List_of_American_exchange-traded_funds'

In [48]:
resp = requests.get(url)

In [49]:
soup = BeautifulSoup(resp.text, 'lxml')
rows = soup.select('div > ul > li')

In [55]:
etfs = {}
for row in rows:
    try:
        etf_name = re.findall('^(.*) \(NYSE', row.text)
        etf_market = re.findall('\((.*)\|', row.text)
        etf_ticker = re.findall('NYSE Arca\|(.*)\)', row.text)
        
        if (len(etf_ticker) > 0) & (len(etf_market) > 0):
            etfs[etf_ticker[0]] = [etf_market[0], etf_name[0]]
            
    except AttributeError as err:
        pass
    
print(etfs)

IndexError: list index out of range

In [56]:
from bs4 import BeautifulSoup
import requests
import re
import pandas as pd

# 위키피디아 미국 ETF 웹 페이지에서 필요한 정보를 스크래핑하여 딕셔너리 형태로 변수 etfs에 저장
url = "https://en.wikipedia.org/wiki/List_of_American_exchange-traded_funds"
resp = requests.get(url)
soup = BeautifulSoup(resp.text, 'lxml')   
rows = soup.select('div > ul > li')
    
etfs = {}
for row in rows:
    
    try:
        etf_name = re.findall('^(.*) \(NYSE', row.text)
        etf_market = re.findall('\((.*)\|', row.text)
        etf_ticker = re.findall('NYSE Arca\|(.*)\)', row.text)
        
        if (len(etf_ticker) > 0) & (len(etf_market) > 0):
            etfs[etf_ticker[0]] = [etf_market[0], etf_name[0]]

    except AttributeError as err:
        pass    

# etfs 딕셔너리 출력
print(etfs)
print('\n')

# etfs 딕셔너리를 데이터프레임으로 변환
df = pd.DataFrame(etfs)
print(df)

IndexError: list index out of range

In [60]:
d = {}

In [63]:
d[1] = [2]

In [64]:
d

{1: [2]}

In [65]:
import googlemaps

In [69]:
data = {'name': ['Jerry', 'Riah', 'Paul'],\
       'algol': ['A', 'A+', 'B'],\
       'basic': ['C', 'B', 'B+'],\
       'c++': ['B+', 'C', 'C+']}

df = pd.DataFrame(data)
df.set_index(['name'], inplace=True)
print(df)

df.to_csv('./df_sample.csv')

      algol basic c++
name
Jerry     A     C  B+
Riah     A+     B   C
Paul      B    B+  C+

In [71]:
df.to_json('./df_sample.json')

In [72]:
df.to_excel('./df_sample.xlsx')

In [73]:
data1 = {'name': ['Jerry', 'Riah', 'Paul'],\
       'algol': ['A', 'A+', 'B'],\
       'basic': ['C', 'B', 'B+'],\
       'c++': ['B+', 'C', 'C+']}
data2 = {'c0' :[1, 2, 3],\
        'c1' :[4, 5, 6],\
        'c2' :[7, 8, 9],\
        'c3' :[10, 11, 12],\
        'c4' :[13, 14, 15]}

df1 = pd.DataFrame(data1)
df1.set_index('name', inplace=True)

df2 = pd.DataFrame(data2)
df2.set_index('c0', inplace=True)

In [74]:
writer = pd.ExcelWriter('./df_execlwriter.xlsx')
df1.to_excel(writer, sheet_name='sheet1')
df2.to_excel(writer, sheet_name='sheet2')
writer.save()